src_Extension/DataProcessors/ДеревоСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДеревоСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src_Extension/Enums/СпособыПолученияМатериаловВСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыПолученияМатериаловВСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизвестиПоСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводитсяНаЭтапе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Catalogs/ЭтапыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапыПроизводства</Name>
			<Owners>
				<xr:Item>Catalog.РесурсныеСпецификации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующегоЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводствоНаСтороне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УслугиПереработчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_Extension/DataProcessors/ДеревоСпецификаций/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Перем СтатьяКалькуляцииТехотход;  
Перем СтатьяКалькуляцииПокупныеКомплектующие;
Перем СтатьяКалькуляцииПокупныеМатериалы;
Перем СтатьяКалькуляцииЗамена;
Перем ВидыРаботФиктивные; 
Перем СтатьиКалькуляцииСборок;

Перем СтекРекурсии;

Функция ПолучитьТЧМатериалыИУслугиИзСпецификацииБезЗаглушек( Спецификация )
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НомерПервогоЭтапа.Владелец КАК Спецификация,
	               |	ЭтапыПроизводства.Подразделение КАК ПодразделениеПервогоЭтапа
	               |ПОМЕСТИТЬ ВТПервыйЭтап
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЭтапыПроизводства.Владелец КАК Владелец,
	               |		МИНИМУМ(ЭтапыПроизводства.НомерЭтапа) КАК НомерЭтапа
	               |	ИЗ
	               |		Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	               |	ГДЕ
	               |		ЭтапыПроизводства.Владелец = &Спецификация
	               |		И НЕ ЭтапыПроизводства.ПометкаУдаления
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЭтапыПроизводства.Владелец) КАК НомерПервогоЭтапа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	               |		ПО НомерПервогоЭтапа.Владелец = ЭтапыПроизводства.Владелец
	               |			И НомерПервогоЭтапа.НомерЭтапа = ЭтапыПроизводства.НомерЭтапа
	               |ГДЕ
	               |	ЭтапыПроизводства.Владелец = &Спецификация
	               |	И НЕ ЭтапыПроизводства.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Характеристика КАК Характеристика,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХраненияОстатков,
	               |	ВЫБОР
	               |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Числитель / РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель
	               |	КОНЕЦ КАК КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Упаковка КАК Упаковка,
	               |	ВЫБОР
	               |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель = 0
	               |						ТОГДА 1
	               |					ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Числитель / РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель = 0
	               |					ТОГДА 1
	               |				ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
	               |			КОНЕЦ
	               |	КОНЕЦ КАК КоэффициентУпаковкиКБазовойЕдиницеИзмерения,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ВЫРАЗИТЬ(РесурсныеСпецификацииМатериалыИУслуги.АлгоритмРасчетаКоличества КАК СТРОКА(200)) КАК АлгоритмРасчетаКоличества,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СпособПолученияМатериала КАК СпособПолученияМатериала,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
	               |	ВЫБОР
	               |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
	               |			ТОГДА ВТПервыйЭтап.ПодразделениеПервогоЭтапа
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Этап.Подразделение
	               |	КОНЕЦ КАК Подразделение,
	               |	СУММА(ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслугиТехотход.КоличествоУпаковок, 0)) КАК КоличествоУпаковокТехотход,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслугиТехотход.АлгоритмРасчетаКоличества, """") КАК СТРОКА(200))) КАК АлгоритмРасчетаКоличестваТехотход
	               |ПОМЕСТИТЬ ВТМатериалыИУслуги
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПервыйЭтап КАК ВТПервыйЭтап
	               |		ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = ВТПервыйЭтап.Спецификация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслугиТехотход
	               |		ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = РесурсныеСпецификацииМатериалыИУслугиТехотход.Ссылка
	               |			И РесурсныеСпецификацииМатериалыИУслуги.Номенклатура = РесурсныеСпецификацииМатериалыИУслугиТехотход.Номенклатура
	               |			И РесурсныеСпецификацииМатериалыИУслуги.Характеристика = РесурсныеСпецификацииМатериалыИУслугиТехотход.Характеристика
	               |			И РесурсныеСпецификацииМатериалыИУслуги.Этап = РесурсныеСпецификацииМатериалыИУслугиТехотход.Этап
	               |			И РесурсныеСпецификацииМатериалыИУслуги.Упаковка = РесурсныеСпецификацииМатериалыИУслугиТехотход.Упаковка
	               |			И (РесурсныеСпецификацииМатериалыИУслугиТехотход.СтатьяКалькуляции = &СтатьяКалькуляцииТехотход)
	               |ГДЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &Спецификация
	               |	И РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.Артикул <> &АртикулЗаглушкиМатериала
	               |	И РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции <> &СтатьяКалькуляцииЗамена
	               |	И РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции <> &СтатьяКалькуляцииТехотход
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.ИсточникПолученияПолуфабриката,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Характеристика,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СпособПолученияМатериала,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	ВЫРАЗИТЬ(РесурсныеСпецификацииМатериалыИУслуги.АлгоритмРасчетаКоличества КАК СТРОКА(200)),
	               |	ВЫБОР
	               |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
	               |			ТОГДА ВТПервыйЭтап.ПодразделениеПервогоЭтапа
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Этап.Подразделение
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Числитель / РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА РесурсныеСпецификацииМатериалыИУслуги.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель = 0
	               |						ТОГДА 1
	               |					ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Числитель / РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель = 0
	               |					ТОГДА 1
	               |				ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	ВТМатериалыИУслуги.Характеристика КАК Характеристика,
	               |	ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХраненияОстатков,
	               |	ВЫБОР
	               |		КОГДА ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Числитель / ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель
	               |	КОНЕЦ КАК КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения,
	               |	ВТМатериалыИУслуги.Упаковка КАК Упаковка,
	               |	ВЫБОР
	               |		КОГДА ВТМатериалыИУслуги.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель = 0
	               |						ТОГДА 1
	               |					ИНАЧЕ ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Числитель / ВТМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Знаменатель
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТМатериалыИУслуги.Упаковка.Знаменатель = 0
	               |					ТОГДА 1
	               |				ИНАЧЕ ВТМатериалыИУслуги.Упаковка.Числитель / ВТМатериалыИУслуги.Упаковка.Знаменатель
	               |			КОНЕЦ
	               |	КОНЕЦ КАК КоэффициентУпаковкиКБазовойЕдиницеИзмерения,
	               |	ВТМатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ВТМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ВТМатериалыИУслуги.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
	               |	ВТМатериалыИУслуги.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
	               |	ВТМатериалыИУслуги.СпособПолученияМатериала КАК СпособПолученияМатериала,
	               |	ВТМатериалыИУслуги.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
	               |	ОсновныеСпецификации.Ссылка КАК ОсновнаяСпецификация,
	               |	ВТМатериалыИУслуги.КоличествоУпаковокТехотход КАК КоличествоУпаковокТехотход,
	               |	ВТМатериалыИУслуги.АлгоритмРасчетаКоличестваТехотход КАК АлгоритмРасчетаКоличестваТехотход,
	               |	ВТМатериалыИУслуги.Подразделение КАК Подразделение
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ВТМатериалыИУслуги КАК ВТМатериалыИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РесурсныеСпецификации.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	               |		ГДЕ
	               |			НЕ РесурсныеСпецификации.ПометкаУдаления
	               |			И РесурсныеСпецификации.Статус.Порядок = 1
	               |			И РесурсныеСпецификации.ВариантПодбораВДокументы.Порядок = 0) КАК ОсновныеСпецификации
	               |		ПО ВТМатериалыИУслуги.Номенклатура = ОсновныеСпецификации.Ссылка.ОсновноеИзделиеНоменклатура
	               |ГДЕ
	               |	ВТМатериалыИУслуги.Номенклатура.Артикул <> &АртикулЗаглушкиМатериала
	               |	И ВТМатериалыИУслуги.СтатьяКалькуляции <> &СтатьяКалькуляцииЗамена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.Характеристика КАК Характеристика,
	               |	ВТ.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	               |	ВТ.КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения КАК КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения,
	               |	ВТ.Упаковка КАК Упаковка,
	               |	ВТ.КоэффициентУпаковкиКБазовойЕдиницеИзмерения КАК КоэффициентУпаковкиКБазовойЕдиницеИзмерения,
	               |	ВТ.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ВТ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ВТ.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
	               |	ВТ.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
	               |	ВТ.СпособПолученияМатериала КАК СпособПолученияМатериала,
	               |	ВТ.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
	               |	ВТ.ОсновнаяСпецификация КАК ОсновнаяСпецификация,
	               |	ЕСТЬNULL(ВТ.КоличествоУпаковок / ВТ.КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения * ВТ.КоэффициентУпаковкиКБазовойЕдиницеИзмерения, 0) КАК КоличествоЕдиницХранения,
	               |	ЕСТЬNULL(ВТ.КоличествоУпаковокТехотход * ВТ.КоэффициентУпаковкиКБазовойЕдиницеИзмерения / ВТ.КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения, 0) КАК КоличествоЕдиницХраненияТехотход,
	               |	ВТ.АлгоритмРасчетаКоличестваТехотход КАК АлгоритмРасчетаКоличестваТехотход,
	               |	ВТ.Подразделение КАК Подразделение
	               |ИЗ
	               |	ВТ КАК ВТ";
	Запрос.УстановитьПараметр( "Спецификация", Спецификация);
	Запрос.УстановитьПараметр( "АртикулЗаглушкиМатериала", "9999999999" );
	Запрос.УстановитьПараметр( "СтатьяКалькуляцииЗамена", СтатьяКалькуляцииЗамена );
	Запрос.УстановитьПараметр( "СтатьяКалькуляцииТехотход", СтатьяКалькуляцииТехотход );
	МатериалыИУслуги = Запрос.Выполнить().Выгрузить();

	Возврат МатериалыИУслуги;
КонецФункции     

Процедура ДобавитьВДеревоСпецификацииРекурсивно( СтрокаДСпец, ВключатьМатериалы )
	
	Спец = СтрокаДСпец.Спецификация;
	Если Не ЗначениеЗаполнено(Спец)
	Тогда
		Возврат;
	КонецЕсли;
	ВыходноеКоличество = Спец.ВыходныеИзделия[0].КоличествоУпаковок;
	
	МатериалыИУслуги = ПолучитьТЧМатериалыИУслугиИзСпецификацииБезЗаглушек( Спец );
	Для Каждого Вход Из МатериалыИУслуги Цикл
		Если Вход.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе тогда
			Продолжить; 
		КонецЕсли;
		Если ЗначениеЗаполнено(Вход.АлгоритмРасчетаКоличества)
		Тогда
			Количество2 = ЭТП.ВыполнитьАлгоритмРасчетаКоличества( Вход.АлгоритмРасчетаКоличества, ВыходноеКоличество ); 
			Количество2 = Количество2 * Вход.КоэффициентУпаковкиКБазовойЕдиницеИзмерения / Вход.КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения;
		Иначе
			Количество2 = Вход.КоличествоЕдиницХранения;
		КонецЕсли;
		Количество2 = Количество2 / ВыходноеКоличество;
		
		Если ЗначениеЗаполнено(Вход.АлгоритмРасчетаКоличестваТехотход)
		Тогда
			КоличествоТО = ЭТП.ВыполнитьАлгоритмРасчетаКоличества( Вход.АлгоритмРасчетаКоличестваТехотход, ВыходноеКоличество ); 
			КоличествоТО = КоличествоТО * Вход.КоэффициентУпаковкиКБазовойЕдиницеИзмерения / Вход.КоэффициентЕдиницыХраненияКБазовойЕдиницеХранения;
		Иначе
			КоличествоТО = Вход.КоличествоЕдиницХраненияТехотход;
		КонецЕсли;
		НовоеКоличествоТехотход = КоличествоТО / ВыходноеКоличество;
		
		Если Вход.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации И
				ЗначениеЗаполнено(Вход.ИсточникПолученияПолуфабриката) Тогда
			
			НовСДЗ = СтрокаДСпец.Строки.Добавить();
			НовСДЗ.Номенклатура = Вход.Номенклатура;
			НовСДЗ.Покупной = Ложь;
			НовСДЗ.Количество = Количество2;
			НовСДЗ.КоличествоТО = НовоеКоличествоТехотход;
			НовСДЗ.ЕдиницаИзмерения = Вход.Упаковка;
			НовСДЗ.Спецификация = Вход.ИсточникПолученияПолуфабриката;
			НовСДЗ.Основная = Истина;
			
			ДобавитьВДеревоСпецификацииРекурсивно( НовСДЗ, ВключатьМатериалы );
		Иначе 
			НеРазузловывать = Истина;
			Если СтатьиКалькуляцииСборок.Найти(Вход.СтатьяКалькуляции)<>Неопределено тогда
				СписокСпецификаций = ЭТП.ПолучитьСписокСпецификаций( Вход.Номенклатура, Истина );
				Если СписокСпецификаций.Количество() > 0
				Тогда
					НовСДЗ = СтрокаДСпец.Строки.Добавить();
					НовСДЗ.Номенклатура = Вход.Номенклатура;
					НовСДЗ.Покупной = Ложь;
					НовСДЗ.Количество = Количество2;
					НовСДЗ.КоличествоТО = НовоеКоличествоТехотход;
					НовСДЗ.ЕдиницаИзмерения = Вход.Упаковка;
					НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;
					НовСДЗ.Основная = СписокСпецификаций[0].Основная;
					
					ДобавитьВДеревоСпецификацииРекурсивно( НовСДЗ, ВключатьМатериалы );
					НеРазузловывать = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если ВключатьМатериалы И НеРазузловывать Тогда
				НовСДЗ = СтрокаДСпец.Строки.Добавить();
				НовСДЗ.Номенклатура = Вход.Номенклатура;
				НовСДЗ.Количество = Количество2;
				НовСДЗ.КоличествоТО = НовоеКоличествоТехотход;
				НовСДЗ.ЕдиницаИзмерения = Вход.Упаковка;
				НовСДЗ.Покупной = Истина;
			КонецЕсли;			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПостроитьДеревоНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Номенклатура)
	Тогда
		Возврат;
	КонецЕсли;
	
	РеалД = РеквизитФормыВЗначение("Дерево");
	РеалД.Строки.Очистить();
	
	СтатьяКалькуляцииТехотход = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Техотход");
	СтатьяКалькуляцииПокупныеКомплектующие = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные комплектующие");
	СтатьяКалькуляцииПокупныеМатериалы = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
	СтатьяКалькуляцииЗамена = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("ЗАМЕНА", Истина);
	ВидыРаботФиктивные = Справочники.ВидыРаботСотрудников.НайтиПоНаименованию("Фиктивные");
	ЗаполнитьСтатьиКалькуляцииСборок();
	
	СписокСпецификаций = ЭТП.ПолучитьСписокСпецификаций( Объект.Номенклатура );
	Если СписокСпецификаций.Количество() > 0
	Тогда
		
		НовСДЗ = РеалД.Строки.Добавить();
		НовСДЗ.Номенклатура = Объект.Номенклатура;
		НовСДЗ.Количество = 1;
	
		Если СписокСпецификаций.Количество() = 1 
		Тогда
			НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;		
			НовСДЗ.Основная = СписокСпецификаций[0].Основная;
		Иначе
			Если СписокСпецификаций[0].Основная
			Тогда
				НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;		
				НовСДЗ.Основная = СписокСпецификаций[0].Основная;
			Иначе
				НовСДЗ.Ошибка = Истина;
			КонецЕсли;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(НовСДЗ.Спецификация)
		Тогда
			//МенеджерВТ = РассчитатьМатериалыИзделия(НовСДЗ.Спецификация);
			ДобавитьВДеревоСпецификацииРекурсивно( НовСДЗ, Ложь );
		КонецЕсли;		

	КонецЕсли;
	
	ЗначениеВРеквизитФормы(РеалД, "Дерево");
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьДерево(Команда)
	ПостроитьДеревоНаСервере();
	
	КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева
	Цикл
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.Дерево.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;  
	
КонецПроцедуры

Процедура ПоднятьсяНаУровеньВверхРекурсивно( Номенклатура, РеалД )
//	Если  ПроверкаЗацикливания тогда
		Для каждого Ном из СтекРекурсии цикл
			Если Ном = Номенклатура тогда
				Возврат;
//				ВызватьИсключение "Зацикливание! "+Номенклатура.Код+" "+Номенклатура;
			КонецЕсли;
		КонецЦикла;
		СтекРекурсии.Добавить(Номенклатура);
//	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	РесурсныеСпецификацииВыходныеИзделия.Ссылка.ВариантПодбораВДокументы.Порядок = 0 КАК Основная
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = РесурсныеСпецификацииВыходныеИзделия.Ссылка
	               |ГДЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Закрыта)
	               |	И НЕ РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ПометкаУдаления
	               |	И РесурсныеСпецификацииМатериалыИУслуги.Номенклатура = &Номенклатура
	               |	И (РесурсныеСпецификацииМатериалыИУслуги.Ссылка.КонецДействия >= &ТекущаяДата
	               |			ИЛИ РесурсныеСпецификацииМатериалыИУслуги.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура)
	               |ПО
	               |	Спецификация";
	Запрос.УстановитьПараметр( "Номенклатура", Номенклатура );
	Запрос.УстановитьПараметр( "ТекущаяДата", НачалоДня(ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()
	Тогда
		ПараметрыОтбора = Новый Структура( "Номенклатура", Номенклатура );
		МассивСтрок = РеалД.Строки.НайтиСтроки( ПараметрыОтбора, Ложь );
		Если МассивСтрок.Количество() = 0
		Тогда
			НовСДЗ = РеалД.Строки.Добавить();
			НовСДЗ.Номенклатура = Номенклатура;
			НовСДЗ.Количество = 0;
		КонецЕсли;
	Иначе
		ВыбСпец = РезультатЗапроса.Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам );
		Пока ВыбСпец.Следующий()
		Цикл
			ВыбМат = ВыбСпец.Выбрать();  
//			Если ВыбСпец.Основная тогда 
				//надо брать только те, где явно указана спецификация, иначе теряем часть спецзаказов
				//но здесь полностью переделывать логику
				ПоднятьсяНаУровеньВверхРекурсивно( ВыбСпец.Номенклатура, РеалД );
//			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
//	Если  ПроверкаЗацикливания тогда
		СтекРекурсии.Удалить(СтекРекурсии.ВГраница());
//	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КудаВходитНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Номенклатура)
	Тогда
		Возврат;
	КонецЕсли;
	
	РеалД = РеквизитФормыВЗначение("Дерево");
	РеалД.Строки.Очистить();
	
//	Если ПроверкаЗацикливания тогда
		СтекРекурсии = Новый Массив;
//	КонецЕсли;
	
	ПоднятьсяНаУровеньВверхРекурсивно( Объект.Номенклатура, РеалД );
	
	ЗначениеВРеквизитФормы(РеалД, "Дерево");
	
КонецПроцедуры

&НаКлиенте
Процедура КудаВходит(Команда)
	КудаВходитНаСервере();
КонецПроцедуры

Процедура СделатьДеревоПлоскимРекурсивно( ПлоскоеДерево, СтрокаПравильногоДерева, Количество )
	
	Для Каждого СДЗ Из СтрокаПравильногоДерева.Строки
	Цикл
		Количество2 = Количество * СДЗ.Количество;
		КоличествоТО = Количество * СДЗ.КоличествоТО;
		
		ПараметрыОтбора = Новый Структура("Номенклатура, ЕдиницаИзмерения", СДЗ.Номенклатура, СДЗ.ЕдиницаИзмерения );
		ПлоскиеСтроки = ПлоскоеДерево.Строки.НайтиСтроки( ПараметрыОтбора );
		Если ПлоскиеСтроки.Количество() = 0
		Тогда
			ПлоскаяСДЗ = ПлоскоеДерево.Строки.Добавить();
			ПлоскаяСДЗ.Номенклатура = СДЗ.Номенклатура;
			ПлоскаяСДЗ.Покупной = СДЗ.Покупной;
			ПлоскаяСДЗ.ЕдиницаИзмерения = СДЗ.ЕдиницаИзмерения;
			ПлоскаяСДЗ.Количество = 0;
		Иначе
			ПлоскаяСДЗ = ПлоскиеСтроки[0];
		КонецЕсли;
		ПлоскаяСДЗ.Количество = ПлоскаяСДЗ.Количество + Количество2 + КоличествоТО;
		Если ЗначениеЗаполнено(ОтладкаМатериал) И 
			ОтладкаМатериал = СДЗ.Номенклатура
		Тогда
			Сооб = Новый СообщениеПользователю;
			Сооб.Текст = "Материал входит в " + СДЗ.Номенклатура + "(" + СДЗ.Спецификация + "), количество = " + Строка(Количество2+КоличествоТО) + " " + СДЗ.ЕдиницаИзмерения;
			Сооб.КлючДанных = СДЗ.Спецификация;
			Сооб.Сообщить();
		КонецЕсли;						
		
		СделатьДеревоПлоскимРекурсивно( ПлоскоеДерево, СДЗ, Количество2 );
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолнаяПрименяемостьНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Номенклатура)
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеалО = РеквизитФормыВЗначение("Объект");
	РеалД = РеквизитФормыВЗначение("Дерево");
	РеалД.Строки.Очистить();
	ДеревоПП = РеалД.Скопировать();
	
	СтатьяКалькуляцииТехотход = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Техотход");
	СтатьяКалькуляцииПокупныеКомплектующие = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные комплектующие");
	СтатьяКалькуляцииПокупныеМатериалы = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
	СтатьяКалькуляцииЗамена = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("ЗАМЕНА", Истина);
	ВидыРаботФиктивные = Справочники.ВидыРаботСотрудников.НайтиПоНаименованию("Фиктивные");
	ЗаполнитьСтатьиКалькуляцииСборок();
	
	СписокСпецификаций = ЭТП.ПолучитьСписокСпецификаций( Объект.Номенклатура );
	Если СписокСпецификаций.Количество() > 0
	Тогда
		
		НовСДЗ = ДеревоПП.Строки.Добавить();
		НовСДЗ.Номенклатура = Объект.Номенклатура;
		НовСДЗ.Количество = 1;
	
		Если СписокСпецификаций.Количество() = 1 
		Тогда
			НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;		
			НовСДЗ.Основная = СписокСпецификаций[0].Основная;
		Иначе
			Если СписокСпецификаций[0].Основная
			Тогда
				НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;		
				НовСДЗ.Основная = СписокСпецификаций[0].Основная;
			Иначе
				НовСДЗ.Ошибка = Истина;
			КонецЕсли;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(НовСДЗ.Спецификация)
		Тогда
			//МенеджерВТ = РассчитатьМатериалыИзделия(НовСДЗ.Спецификация);
			ДобавитьВДеревоСпецификацииРекурсивно( НовСДЗ, Ложь );
		КонецЕсли;		

		СделатьДеревоПлоскимРекурсивно( РеалД, НовСДЗ, 1 );
		
	КонецЕсли;
	
	
	СхемаКомпоновкиДанных = РеалО.ПолучитьМакет("СхемаКомпоновкиДанных");
	СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", "Полная применяемость для" + Символы.ПС + Объект.Номенклатура );
	СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Истина );
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных) );
	КомпоновщикНастроек.ЗагрузитьНастройки( СхемаКомпоновкиДанных.НастройкиПоУмолчанию );
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
			СхемаКомпоновкиДанных, 
			КомпоновщикНастроек.ПолучитьНастройки(),
			,
			РеалО.ПолучитьМакет("МакетОформления")
			 );
			 
	ВнешниеНаборыДанных = Новый Структура("ПлоскоеДерево", РеалД );
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать( МакетКомпоновки, ВнешниеНаборыДанных );
	
	ТабДок2 = Новый ТабличныйДокумент;
	
	ПроцессорВывода = новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент( ТабДок2 );
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ТабДок2.ОтображатьЗаголовки = Ложь;
	ТабДок2.ОтображатьСетку = Ложь;
	
	ЗначениеВРеквизитФормы(РеалД, "Дерево");
	
	Возврат ТабДок2;
	
КонецФункции

&НаКлиенте
Процедура ПолнаяПрименяемость(Команда)
	ТабДок = ПолнаяПрименяемостьНаСервере();
	Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент")
	Тогда
		ТабДок.Показать("Полная применяемость");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура МатериалыНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Номенклатура)
	Тогда
		Возврат;
	КонецЕсли;
	
	РеалД = РеквизитФормыВЗначение("Дерево");
	РеалД.Строки.Очистить();
	ДеревоПП = РеалД.Скопировать();
	
	СтатьяКалькуляцииТехотход = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Техотход");
	СтатьяКалькуляцииПокупныеКомплектующие = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные комплектующие");
	СтатьяКалькуляцииПокупныеМатериалы = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
	СтатьяКалькуляцииЗамена = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("ЗАМЕНА", Истина);
	ВидыРаботФиктивные = Справочники.ВидыРаботСотрудников.НайтиПоНаименованию("Фиктивные");
	ЗаполнитьСтатьиКалькуляцииСборок();
	
	СписокСпецификаций = ЭТП.ПолучитьСписокСпецификаций( Объект.Номенклатура );
	Если СписокСпецификаций.Количество() > 0
	Тогда
		
		НовСДЗ = ДеревоПП.Строки.Добавить();
		НовСДЗ.Номенклатура = Объект.Номенклатура;
		НовСДЗ.Количество = 1;
	
		Если СписокСпецификаций.Количество() = 1 
		Тогда
			НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;		
			НовСДЗ.Основная = СписокСпецификаций[0].Основная;
		Иначе
			Если СписокСпецификаций[0].Основная
			Тогда
				НовСДЗ.Спецификация = СписокСпецификаций[0].Спецификация;		
				НовСДЗ.Основная = СписокСпецификаций[0].Основная;
			Иначе
				НовСДЗ.Ошибка = Истина;
			КонецЕсли;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(НовСДЗ.Спецификация)
		Тогда
			//МенеджерВТ = РассчитатьМатериалыИзделия(НовСДЗ.Спецификация);
			ДобавитьВДеревоСпецификацииРекурсивно( НовСДЗ, Истина );
		КонецЕсли;		

		СделатьДеревоПлоскимРекурсивно( РеалД, НовСДЗ, 1 );
		Ном = 0;
		Пока Ном < РеалД.Строки.Количество()
		Цикл
			Если РеалД.Строки[Ном].Покупной = Ложь
			Тогда
				РеалД.Строки.удалить( Ном );
			Иначе
				Ном = Ном + 1;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(РеалД, "Дерево");
	
КонецПроцедуры

&НаКлиенте
Процедура Материалы(Команда)
	МатериалыНаСервере();
КонецПроцедуры 

//&НаСервере
//Функция РассчитатьМатериалыИзделия(Спец)
//	Изделия = Новый ТаблицаЗначений;
//	Изделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
//	Изделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//	Изд = Изделия.Добавить();
//	Изд.Спецификация = Спец;
//	Изд.Количество = 1000;
//	Возврат ЭТП.РассчитатьМатериалы(Изделия);
//КонецФункции

//&НаСервере
Процедура ЗаполнитьСтатьиКалькуляцииСборок()
	СтатьиКалькуляцииСборок = Новый Массив;
	СтатьяКаль = Справочники.СтатьиКалькуляции.НайтиПоРеквизиту("ИдентификаторДляФормул","ПолуфабрикатыСобственные");
	Если ЗначениеЗаполнено(СтатьяКаль) тогда
		СтатьиКалькуляцииСборок.Добавить(СтатьяКаль);
	КонецЕсли;
	СтатьяКаль = Справочники.СтатьиКалькуляции.НайтиПоРеквизиту("ИдентификаторДляФормул","ПолуфабрикатыПроизводимыеВПроцессе");
	Если ЗначениеЗаполнено(СтатьяКаль) тогда
		СтатьиКалькуляцииСборок.Добавить(СтатьяКаль);
	КонецЕсли;   
	СтатьяКаль = Справочники.СтатьиКалькуляции.НайтиПоРеквизиту("ИдентификаторДляФормул","ПолуфабрикатыПроизводимыеНаСтороне");
	Если ЗначениеЗаполнено(СтатьяКаль) тогда
		СтатьиКалькуляцииСборок.Добавить(СтатьяКаль);
	КонецЕсли;
КонецПроцедуры;
